# Taps & Installers
tap "homebrew/cask-fonts"
tap "hashicorp/tap"
brew "mas"

# Fonts
cask "font-hack-nerd-font"

# Tools
brew "bat"
brew "bottom"
brew "chruby"
brew "cmake"
brew "exa"
brew "fd"
brew "fnm"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
cask "google-cloud-sdk"
brew "java"
brew "jq"
brew "neofetch"
brew "neovim"
brew "ripgrep"
brew "ruby-install"
brew "starship"
brew "stow"
brew "hashicorp/tap/terraform"
brew "tmux"
brew "tre-command"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Apps
cask "brave-browser"
cask "cloudflare-warp"
cask "discord"
cask "docker"
cask "google-chrome"
cask "imageoptim"
brew "imageoptim-cli"
cask "karabiner-elements"
cask "kitty"
cask "rectangle"
cask "slack"
cask "unnaturalscrollwheels"
