# Taps & Installers
tap "homebrew/cask-fonts"
tap "hashicorp/tap"
brew "mas"

# Fonts
cask "font-hack-nerd-font"

# Tools
brew "bat"
brew "bottom"
brew "cmake"
brew "colima"
brew "coreutils"
brew "docker"
brew "dust"
brew "eza"
brew "fd"
brew "firebase-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "gmp"
brew "gnupg"
cask "google-cloud-sdk"
brew "httpie"
brew "jq"
brew "kubernetes-cli"
brew "kustomize"
brew "libyaml"
brew "mise"
brew "neofetch"
brew "neovim"
brew "openssl@3"
brew "readline"
brew "ripgrep"
brew "starship"
brew "stow"
brew "hashicorp/tap/terraform"
brew "tealdeer"
brew "tmux"
brew "tre-command"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Apps
cask "arc"
cask "brave-browser"
cask "cloudflare-warp"
cask "discord"
cask "imageoptim"
brew "imageoptim-cli"
cask "karabiner-elements"
cask "slack"
cask "stats"
cask "unnaturalscrollwheels"
cask "wezterm"
